artillery-test.yml
config:
  target: "https://quiz-platform-production-949c.up.railway.app"
  phases:
    # Phase 1: Warm up with 50 users
    - duration: 30
      arrivalRate: 5
      name: "Warm up - 50 users"
    
    # Phase 2: Ramp to 150 users
    - duration: 60
      arrivalRate: 15
      name: "Ramp up to 150"
    
    # Phase 3: Peak load - 200 users
    - duration: 120
      arrivalRate: 20
      name: "Peak - 200 concurrent users"
    
    # Phase 4: Sustain
    - duration: 60
      arrivalRate: 20
      name: "Sustained 200 users"
    
  socketio:
    transports: ["websocket"]
    path: "/socket.io"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Max 1% errors
    p95: 2000        # 95th percentile response time under 2s

scenarios:
  - name: "Player Flow - Join and Play Quiz"
    engine: socketio
    flow:
      # Connect and join room
      - emit:
          channel: "join_room"
          data:
            roomCode: "PB6ND7"  # Production room code
            playerName: "Player_{{ $randomString() }}"
            playerId: "uid_{{ $randomString() }}"
          acknowledge:
            match:
              value: "success"
      
      # Wait for game to start (simulating lobby wait)
      - think: 3
      
      # Listen for questions
      - on:
          channel: "new_question_player"
          response:
            - emit:
                channel: "submit_answer"
                data:
                  roomCode: "PB6ND7"
                  answerIndex: "{{ $randomNumber(0, 3) }}"
                  timeRemaining: "{{ $randomNumber(2, 8) }}"
                  playerId: "uid_{{ $randomString() }}"
      
      # Random think time (simulating actual player behavior)
      - think: "{{ $randomNumber(1, 3) }}"
      
      # Stay connected for question results
      - think: 5
      
      # Second question (if exists)
      - on:
          channel: "new_question_player"
          response:
            - emit:
                channel: "submit_answer"
                data:
                  roomCode: "PB6ND7"
                  answerIndex: "{{ $randomNumber(0, 3) }}"
                  timeRemaining: "{{ $randomNumber(2, 8) }}"
                  playerId: "uid_{{ $randomString() }}"
      
      # Wait for final results
      - think: 10